[
  {
    "src": "https://clubmahindra.gumlet.io/blog/images/dalmakhani-bc5ffb131c13648-resized.jpg?w=800&dpr=1.5",
    "name": "Dal Makhani",
    "desc": "Dal Makhani Dal Makhani is a popular Punjabi lentil dish made with black lentils (urad dal) and kidney beans (rajma) in a rich, creamy tomato-based sauce. The dish is flavored with aromatic spices, including cumin, coriander, and garam masala, and is often served with basmati rice or roti. Dal Makhani is a staple of North Indian cuisine and is known for its comforting, velvety texture and deep, satisfying flavor. This dish is a favorite in many Indian restaurants and is also easy to make at home. With its perfect balance of protein, fiber, and flavor, Dal Makhani is a nutritious and delicious addition to any meal.",
    "isBookmarked":false
    
  },
  {
    "src": "https://th.bing.com/th/id/OIP.cCKbw2IH4dHhvxI9BZ7PsgHaFj?rs=1&pid=ImgDetMain",
    "name": "Chana Masala",
    "desc": "Chana Masala is a popular North Indian dish made with chickpeas cooked in a rich, flavorful tomato-based sauce. The dish is flavored with aromatic spices, including cumin, coriander, and garam masala, and is often served with basmati rice or roti. Chana Masala is a staple of Indian street food and is known for its comforting, slightly spicy flavor.",
    "isBookmarked":false
    
  },
  {
    "src": "https://th.bing.com/th/id/OIP.JdZkIOJ0w0-2ZfQvylBQQgHaE7?rs=1&pid=ImgDetMain",
    "name": "Palak Paneer",
    "desc": "Palak Paneer is a creamy, spinach-based curry made with paneer (Indian cheese), spinach puree, and spices. The dish is flavored with garlic, ginger, and garam masala, and is often served with basmati rice or roti. Palak Paneer is a popular vegetarian dish in Indian cuisine and is known for its rich, creamy texture and mild flavor.",
    "isBookmarked":false
    
  },
  {
    "src": "https://th.bing.com/th/id/OIP.Xp2RQVjyCr3kN1G8VhcK_wHaE_?w=266&h=180&c=7&r=0&o=5&dpr=1.4&pid=1.7",
    "name": "Samosas",
    "desc": "Samosas are crispy, savory pastries filled with a mixture of spiced potatoes, peas, and onions. The pastry is typically made with all-purpose flour and ghee, and is fried until golden brown. Samosas are a popular Indian snack and are often served with a side of chutney or tamarind sauce.",
    "isBookmarked":false
    
  },
  {
    "src": "https://th.bing.com/th/id/OIP.2mRI4WZ6-tOaIglF0wfXzQHaHa?rs=1&pid=ImgDetMain",
    "name": "Biryani",
    "desc": "Biryani is a popular South Indian rice dish made with a mixture of basmati rice, spices, and marinated vegetables or meat. The dish is flavored with aromatic spices, including cumin, coriander, and cardamom, and is often served with a side of raita (yogurt sauce). Biryani is a staple of Indian cuisine and is known for its flavorful, aromatic rice and variety of ingredients.",
    "isBookmarked":false
  },
  {
    "src": "https://th.bing.com/th/id/OIP.jHVOWwSFJmKm4WYjoOIS0QHaFk?rs=1&pid=ImgDetMain",
    "name": "Gulab Jamun",
    "desc": "Gulab Jamun is a popular Indian dessert made with deep-fried dumplings soaked in a sweet, rose-water syrup. The dumplings are typically made with milk solids, flour, and ghee, and are flavored with cardamom and saffron. Gulab Jamun is a staple of Indian sweets and is often served at special occasions and festivals.",
    "isBookmarked":false
  },
  {
    "src": "https://www.awesomecuisine.com/wp-content/uploads/2009/06/Plain-Dosa.jpg",
    "name": "Dosa",
    "desc": "Dosa is a popular South Indian fermented crepe made with rice and lentil batter. It is often served with sambar (lentil soup) and chutney.",
    "isBookmarked": false
},

{
    "src": "https://images.unsplash.com/photo-1668236499396-a62d2d1cb0cf?w=600&auto=format&fit=crop&q=60&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxzZWFyY2h8NHx8aWRsaXxlbnwwfHwwfHx8MA%3D%3D",
    "name": "Idli",
    "desc": "Idli is a popular South Indian steamed rice cake made with fermented rice and lentil batter. It is often served with sambar and chutney.",
    "isBookmarked": false
},

{
    "src": "https://www.foodie-trail.com/wp-content/uploads/2021/09/PHOTO-2021-09-06-13-17-11.jpg",
    "name": "Mattar Paneer",
    "desc": "Mattar Paneer is a creamy pea and paneer curry made with onions, garlic, and spices. It is a popular vegetarian dish in Indian restaurants.",
    "isBookmarked": false
},

{
    "src": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRMrxH8SXaiUwbBCPbDGo1nIhGhFlfKRnvcvg&s",
    "name": "Korma",
    "desc": "Korma is a mild and creamy curry dish made with yogurt, nuts, and spices. It is often served with basmati rice and is a popular vegetarian option.",
    "isBookmarked": false
},

{
    "src": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRAoaFsWX34xxQQX1mmSh_-n_Xwja_5sGnAvapI60YJMPNmDCOpE1MURaq3AWQlJ_vgBvU&usqp=CAU",
    "name": "Baingan Bharta",
    "desc": "Baingan Bharta is a popular North Indian dish made by roasting eggplants over an open flame and then mashing them with onions, garlic, and spices.",
    "isBookmarked": false
},


{
    "src": "https://dinedelicious.in/wp-content/uploads/2021/04/Rajma-Masala-9.jpg",
    "name": "Rajma Masala",
    "desc": "Rajma Masala is a popular North Indian kidney bean curry made with onions, garlic, and spices. It is often served with basmati rice.",
    "isBookmarked": false
},
{
  "src": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRJGZZ7cidqHLyfGRstdNh-LsExSIGiCxQP3stvJp5kgQmR3e7R8MuP-oRMUYvgzL50dXc&usqp=CAU",
  "name": "Aloo Gobi",
  "desc": "Aloo Gobi is a classic dry Indian dish that combines the humble potato (aloo) with cauliflower (gobi) to create a flavorful and satisfying vegetarian meal. The dish is seasoned with a variety of spices such as turmeric, cumin, and coriander, which give it a vibrant yellow color and a rich aroma. Aloo Gobi is typically cooked with tomatoes, onions, and sometimes peas, adding layers of flavor and texture. This dish is popular across India and is often served as a side dish with roti or rice. The simplicity of ingredients and the ease of preparation make Aloo Gobi a staple in many Indian households. It is not only nutritious but also a comforting dish that can be enjoyed by vegetarians and non-vegetarians alike.",
  "isBookmarked": false
},
{
  "src": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTi7WLz3rQQkhy03nz-zE8Fm8iH6Z2r_7AN6nQDOswNOCPbN1i77XKTEhi-aPQPbtAeNWg&usqp=CAU",
  "name": "Paneer Tikka",
  "desc": "Paneer Tikka is a popular Indian appetizer made from chunks of paneer, a type of Indian cottage cheese, that are marinated in a blend of spices and yogurt. The marinated paneer is then grilled or baked until it is charred and aromatic. This dish is often served with mint chutney and is a favorite at Indian barbecues and parties. Paneer Tikka is known for its smoky flavor and soft, succulent texture. The dish is not only delicious but also a good source of protein, making it a popular choice among vegetarians. It is often garnished with lemon wedges and onions to enhance the flavor.",
  "isBookmarked": false
},
{
  "src": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQgy8sA3OHgNLLxac2DIwSFS1-jUD3-ANP7gqmwNoRihVkTkEDxanFo9VIFlED-DOV0zIE&usqp=CAU",
  "name": "Aloo Paratha",
  "desc": "Aloo Paratha is a delicious and hearty Indian flatbread stuffed with a spicy potato filling. This popular North Indian breakfast dish is made by rolling out dough made from whole wheat flour and filling it with a mixture of mashed potatoes, spices, and herbs. The filled dough is then cooked on a griddle with ghee or oil until it is golden brown and crispy. Aloo Paratha is often served with butter, yogurt, or pickle, making it a complete meal in itself. The combination of soft, spicy filling and crispy outer layer makes Aloo Paratha a favorite among people of all ages. It is a comforting and satisfying dish that is enjoyed throughout India.",
  "isBookmarked": false
},
{
  "src": "https://i.ytimg.com/vi/kAQTfW-KtxQ/maxresdefault.jpg",
  "name": "Bhindi Masala",
  "desc": "Bhindi Masala is a flavorful and nutritious Indian dish made with okra (bhindi) cooked in a spicy tomato and onion gravy. The okra is sautéed with spices such as cumin, coriander, and turmeric, which enhance its natural flavor and give the dish a rich aroma. Bhindi Masala is a popular side dish in Indian cuisine and is often served with roti or rice. The dish is known for its unique texture, where the okra remains slightly crispy while absorbing the flavors of the spices. Bhindi Masala is not only delicious but also a healthy option, as okra is rich in vitamins and minerals. It is a simple yet satisfying dish that can be enjoyed by everyone.",
  "isBookmarked": false
},
{
  "src": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQlNL-LJl_ThEE3h_JXuwUGiO7j2YG7MrO2Js_cQQcw1MbKoIU2Dcavn6B2aFKFVqC2-cs&usqp=CAU",
  "name": "Chole Bhature",
  "desc": "Chole Bhature is a classic North Indian dish that combines spicy chickpeas (chole) with deep-fried bread (bhature). The chickpeas are cooked in a rich and flavorful gravy made with onions, tomatoes, and a blend of spices. Bhature is a soft and fluffy bread made from fermented dough, which is deep-fried until golden brown. The combination of spicy chickpeas and crispy bhature makes this dish a favorite among food lovers. Chole Bhature is often served with pickles and yogurt to balance the flavors. It is a popular dish for breakfast or lunch and is enjoyed across India for its bold flavors and satisfying taste.",
  "isBookmarked": false
}
  
]
